NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/MGM24/MGM240L022RNF.svd
        <register>
          <name>SNIFFCTRL</name>
          <description>No Description</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <resetValue>0x000007FC</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>SNIFFMODE</name>
              <description>Data Sniff Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>FRC Packet Sniffer mode is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART</name>
                  <description>UART encoded data is transmitted on the DOUT pin.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI</name>
                  <description>SPI data is transmitted on the DOUT pin and a data clock is output to the DCLK pin.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SNIFFBITS</name>
              <description>Data sniff data bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>Each sniffer output word contains 8 data bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NINE</name>
                  <description>Each sniffer output word contains 9 data bits</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SNIFFRXDATA</name>
              <description>Enable sniffing of received data.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNIFFTXDATA</name>
              <description>Enable sniffing of transmitted data.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNIFFRSSI</name>
              <description>Enable sniffing of RSSI</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNIFFSTATE</name>
              <description>Enable sniffing of state information</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNIFFAUXDATA</name>
              <description>Enable sniffing of auxiliary data</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNIFFBR</name>
              <description>Sniffer baudrate setting</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNIFFSYNCWORD</name>
              <description>Sniffer baudrate setting</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXDATA</name>
          <description>No Description</description>
          <addressOffset>0x088</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>AUXDATA</name>
              <description>Auxiliary sniffer data output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAWCTRL</name>
          <description>No Description</description>
          <addressOffset>0x08C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000021BF</resetMask>
          <fields>
            <field>
              <name>TXRAWMODE</name>
              <description>Transmitter raw data mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>RAW transmit mode is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEBUFFER</name>
                  <description>RAW transmit mode is enabled, transmitting the configured raw data (fetched from RAM) once before transmit is completed.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATBUFFER</name>
                  <description>RAW transmit mode is enabled, transmitting the configured raw data (fetched from RAM) repeatedly until the transmitter is disabled.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXRAWMODE</name>
              <description>Receiver raw data mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>RAW receive mode is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEITEM</name>
                  <description>RAW receive mode is enabled, fetching a single item which is stored in the RXRAWDATA register. A new item is  fetched when the RXRAWBLOCKED flag is cleared. In this mode, the flag is cleared automatically when RXRAWDATA is read.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEBUFFER</name>
                  <description>RAW receive mode is enabled, fetching multiple items which are stored to RAM. The RXRAWBLOCKED flag must be cleared  in order to start raw data reception.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEBUFFERFRAME</name>
                  <description>This mode is identical to the SINGLEBUFFER mode, except that the FRC will treat the end of the filled buffer  as the end of a frame reception (i.e. also trigger the RXDONE interrupt and signal to the RAC that frame reception   is complete.)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATBUFFER</name>
                  <description>RAW receive mode is enabled, fetching multiple items which are stored to RAM. The RXRAWBLOCKED flag must be cleared  in order to start raw data reception.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXRAWRANDOM</name>
              <description>Receive raw data random number generator</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXRAWTRIGGER</name>
              <description>Receiver raw data trigger setting</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMMEDIATE</name>
                  <description>RAW data storage is triggered immediately when demodulator is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS</name>
                  <description>RAW data storage is triggered by the selected RXRAWPRSSEL PRS channel.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERNALSIG</name>
                  <description>RAW data storage is triggered by an internal signal</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEMODRAWDATAMUX</name>
              <description>Raw data mux control</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEMODRAWDATASEL</name>
                  <description>RAW data is selected using modem register DEMODRAWDATASEL.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEMODRAWDATASEL2</name>
                  <description>RAW data is selected using modem register DEMODRAWDATASEL2.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXRAWDATA</name>
          <description>No Description</description>
          <addressOffset>0x090</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXRAWDATA</name>
              <description>Receiver RAW data register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAUSEDATA</name>
          <description>No Description</description>
          <addressOffset>0x094</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PAUSEDATA</name>
              <description>Receiver pause data register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIKELYCONVSTATE</name>
          <description>No Description</description>
          <addressOffset>0x098</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>LIKELYCONVSTATE</name>
              <description>Most likely convolutional decoder state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTELEMENTNEXT</name>
          <description>No Description</description>
          <addressOffset>0x09C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>INTELEMENTNEXT</name>
              <description>Interleaver element value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTWRITEPOINT</name>
          <description>No Description</description>
          <addressOffset>0x0A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>INTWRITEPOINT</name>
              <description>Interleaver buffer write pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTREADPOINT</name>
          <description>No Description</description>
          <addressOffset>0x0A4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>INTREADPOINT</name>
              <description>Interleaver buffer read pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOCG</name>
          <description>No Description</description>
          <addressOffset>0x0A8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>AUTOCGEN</name>
              <description>Automatic clock gate enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CGCLKSTOP</name>
          <description>No Description</description>
          <addressOffset>0x0AC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>FORCEOFF</name>
              <description>Force off</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
